9/data/attachments/2df5ec2960c9d132.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Shawn_message_Actions_83459_0</nif:username>
            <nif:friendToBeRequested>soap_actions_7340a7a1-5568-4c98-9752-5bc1cb4e4cee</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>